rails-backend-1/app/controllers/items_controller.rb

    def create
        Item.create(description: params[:description])
---
INSERT INTO "items" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "fhjgdf"], ["created_at", "2022-12-07 23:52:59.348866"], ["updated_at", "2022-12-07 23:52:59.348866"]]