rails-backend-1/app/controllers/items_controller.rb

    def show
        item = Item.find_by_id(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def destroy
        Item.find_by_id(params[:id]).destroy
        items = Item.all
---
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 12]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT "items".* FROM "items"

    def create
        description = params[:item][:description]
        Item.create(description: description)
        items = Item.all
---
INSERT INTO "items" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "sdgfjd"], ["created_at", "2022-12-07 23:53:12.003711"], ["updated_at", "2022-12-07 23:53:12.003711"]]
SELECT "items".* FROM "items"